<a href="https://colab.research.google.com/github/AnnepuHyndhavi/AnnepuHyndhavi/blob/main/Concatanating.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
import pandas as pd
import io

In [29]:
data = {'Day': [5,12,28,26,4,11,18, 9,10,3], 
        'Month': ['Feb','Mar','Apr','May','Jun', 'july', 'Jan','Aug','Sep','Oct'], 
        'Year': [2010,2010,2010,2010,2010,2010,2010, 2010,2010,2010]} 
df1 = pd.DataFrame(data, columns= ['Day','Month','Year']) 

data = {'CPI': [211.096358,211.242170,211.289143,211.319643,211.350143,192.013558,192.170412,192.327265,192.330854,192.308899], 
        'Fuel_Price': [2.572,2.548,2.514,2.561,2.625,3.997,3.985,4.000,3.969,3.882]} 

df2 = pd.DataFrame(data, columns= ['CPI','Fuel_Price'])

pd.concat([df1, df2], axis='columns')

   Day Month  Year         CPI  Fuel_Price
0    5   Feb  2010  211.096358       2.572
1   12   Mar  2010  211.242170       2.548
2   28   Apr  2010  211.289143       2.514
3   26   May  2010  211.319643       2.561
4    4   Jun  2010  211.350143       2.625
5   11  july  2010  192.013558       3.997
6   18   Jan  2010  192.170412       3.985
7    9   Aug  2010  192.327265       4.000
8   10   Sep  2010  192.330854       3.969
9    3   Oct  2010  192.308899       3.882

In [30]:
# creating the Series
df3 = pd.Series([1643690.90, 1641957.44, 1611968.17, 1409727.59, 1554806.68, 1439541.59])
display('df3:', df3)
df4 = pd.Series([42.31, 38.51, 39.93, 46.63, 46.50, 57.79])
display('df4:', df4)

# concatenating
display('Concatanation:')
display(pd.concat([df3, df4],
				axis = 1))

'df3:'

0    1643690.90
1    1641957.44
2    1611968.17
3    1409727.59
4    1554806.68
5    1439541.59
dtype: float64

'df4:'

0    42.31
1    38.51
2    39.93
3    46.63
4    46.50
5    57.79
dtype: float64

'Concatanation:'

            0      1
0  1643690.90  42.31
1  1641957.44  38.51
2  1611968.17  39.93
3  1409727.59  46.63
4  1554806.68  46.50
5  1439541.59  57.79

In [31]:
import pandas as pd

In [32]:
df2 = pd.Series( [5,12])
df1 = pd.Series([211.096358,211.242170])
pd.concat([df1, df2])

0    211.096358
1    211.242170
0      5.000000
1     12.000000
dtype: float64

In [33]:
df2 = pd.Series( [5,12])
df1 = pd.Series([211.096358,211.242170])
pd.concat([df1, df2], axis='columns')

            0   1
0  211.096358   5
1  211.242170  12

In [34]:
# creating the Series
df1 = pd.Series([2.572,2.548,2.514,2.561,2.625,3.997,3.985,4.000,3.969,3.882])
display('df1:', df1)
df2 = pd.Series([211.096358,211.242170,211.289143,211.319643,211.350143,192.013558,192.170412,192.327265,192.330854,192.308899])
display('df2:', df2)

# concatenating
display('concatenating:')
display(pd.concat([df1, df2]))

'df1:'

0    2.572
1    2.548
2    2.514
3    2.561
4    2.625
5    3.997
6    3.985
7    4.000
8    3.969
9    3.882
dtype: float64

'df2:'

0    211.096358
1    211.242170
2    211.289143
3    211.319643
4    211.350143
5    192.013558
6    192.170412
7    192.327265
8    192.330854
9    192.308899
dtype: float64

'concatenating:'

0      2.572000
1      2.548000
2      2.514000
3      2.561000
4      2.625000
5      3.997000
6      3.985000
7      4.000000
8      3.969000
9      3.882000
0    211.096358
1    211.242170
2    211.289143
3    211.319643
4    211.350143
5    192.013558
6    192.170412
7    192.327265
8    192.330854
9    192.308899
dtype: float64

In [35]:
import pandas as pd

In [36]:
df1= pd.DataFrame({
    'Day': [5,12,28], 
    'Month': ['Feb','Mar','Apr'], 
    'Year': [2010,2010,2010]
})

df1

   Day Month  Year
0    5   Feb  2010
1   12   Mar  2010
2   28   Apr  2010

In [37]:
df2= pd.DataFrame({
    'Day': [1,6,30], 
    'Month': ['Sep','Aug','Jun'], 
    'Year': [2010,2010,2010]
})
df2

   Day Month  Year
0    1   Sep  2010
1    6   Aug  2010
2   30   Jun  2010

In [38]:
df= pd.concat([df1,df2])
df

   Day Month  Year
0    5   Feb  2010
1   12   Mar  2010
2   28   Apr  2010
0    1   Sep  2010
1    6   Aug  2010
2   30   Jun  2010

In [39]:
df= pd.concat([df1,df2], ignore_index= True)
df

   Day Month  Year
0    5   Feb  2010
1   12   Mar  2010
2   28   Apr  2010
3    1   Sep  2010
4    6   Aug  2010
5   30   Jun  2010